# StructuralSectionSigmaProfileBendWidth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionSigmaProfileBendWidth Property
ParameterTypeId Class See Also
---
"Bend Width"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionSigmaProfileBendWidth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionSigmaProfileBendWidth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionSigmaProfileBendWidth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace